{
  "backend/main.mo": "Motoko canister implementing user profiles and per-user transactions with authorization checks and monthly filtering and totals.",
  "feature_evidence.json": "Feature evidence report listing features, related files, components, tests, and confidence metadata.",
  "frontend-file-summaries.txt": "Prewritten summaries for various frontend source files used for build planning.",
  "frontend/.env.example": "Example environment file showing optional public app URL and Internet Identity provider configuration.",
  "frontend/index.css": "Tailwind-based global stylesheet defining OKLCH color variables and light/dark theme tokens.",
  "frontend/index.html": "HTML entry point defining metadata, favicon, root container, and script loader for the frontend app.",
  "frontend/README.md": "Frontend documentation covering prerequisites, setup steps, and development workflow.",
  "frontend/src/App.tsx": "Main React component handling identity initialization, login flow, profile setup, and layout rendering.",
  "frontend/src/components/auth/LoginScreen.tsx": "Login screen with branding, feature highlights, and Internet Identity login button.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Modal prompting new users to enter and save their name with validation and feedback.",
  "frontend/src/components/charts/IncomeVsExpenseChart.tsx": "Recharts bar chart visualizing monthly income versus expenses using fetched totals.",
  "frontend/src/components/disclosures/ManualEntryDisclosure.tsx": "Displays a blue info banner explaining that all transactions must be manually entered.",
  "frontend/src/components/layout/AppLayout.tsx": "Provides the main app layout with header, page switching, bottom navigation, and a logout dialog.",
  "frontend/src/components/month/MonthPicker.tsx": "Renders previous/next month controls and displays the currently selected month and year.",
  "frontend/src/components/notifications/MonthlyReminderBanner.tsx": "Shows a dismissible reminder banner when a new month starts with a button to view the summary.",
  "frontend/src/components/summary/MonthlyTotalsCard.tsx": "Fetches and displays monthly income, expenses, and balance in a styled summary card.",
  "frontend/src/components/transactions/TransactionForm.tsx": "Form for adding a transaction with type, amount, date, and note, including validation and submission.",
  "frontend/src/components/transactions/TransactionList.tsx": "Loads and displays a list of monthly transactions with income/expense indicators and fallback states.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor based on identity and invalidates dependent queries when it changes.",
  "frontend/src/hooks/useCurrentUserProfile.ts": "Hooks for fetching and saving the current user's profile using the backend actor and React Query.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity authentication, including login, logout, and identity loading. Wraps AuthClient creation and exposes status flags and identity state.",
  "frontend/src/hooks/useMonthlyReminder.ts": "Manages monthly reminder settings tied to the user's principal, storing acknowledgment and preference state in localStorage. Provides functions to toggle reminders and mark the current month as acknowledged.",
  "frontend/src/hooks/useQueries.ts": "Placeholder file exporting nothing; documents where feature-specific query hooks are located.",
  "frontend/src/hooks/useSelectedMonth.ts": "Tracks the selected month and year in localStorage and exposes setters to update them. Initializes from stored values or defaults to the current month.",
  "frontend/src/hooks/useTransactions.ts": "Defines React Query hooks for adding transactions and fetching month-specific transactions and totals via an actor API. Invalidates relevant queries on mutations.",
  "frontend/src/index.css": "Tailwind CSS configuration defining light and dark mode design tokens using a warm green palette. Applies global base styles and variable-driven theming.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider before rendering App. Imports global CSS.",
  "frontend/src/pages/SettingsPage.tsx": "Renders settings UI showing user profile, notification preferences for monthly reminders, and app info with copy-link functionality. Pulls data from identity, profile, and reminder hooks.",
  "frontend/src/pages/SummaryPage.tsx": "Displays a monthly summary with totals, balance highlight, and charts, acknowledging the month when viewed. Uses selected month, totals query, and reminder logic.",
  "frontend/src/pages/TransactionsPage.tsx": "Shows month picker, disclosure, monthly totals, chart preview, transaction form toggle, and transaction list. Relies on selected month state and allows adding transactions.",
  "frontend/src/utils/copyToClipboard.ts": "Implements clipboard copy utility using the modern Clipboard API with a textarea-based fallback. Returns success status as a boolean.",
  "frontend/src/utils/getPublicAppUrl.ts": "Returns the app’s public URL using an env var if available, otherwise falling back to window.location.origin.",
  "frontend/src/utils/urlParams.ts": "Helpers for reading URL params (including hash), persisting them in sessionStorage, and clearing them when needed.",
  "frontend/src/vite-env.d.ts": "Type definitions for Vite environment variables used by the app.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom colors, container settings, animations, and plugins.",
  "project_state.json": "Project state file describing build issues, feature requirements, and deployment stabilization goals."
}