{
  "backend/main.mo": "Actor implementing user profiles, access control, transaction storage, monthly filtering, and monthly totals calculations.",
  "feature_evidence.json": "Feature evidence report mapping features to associated source files, components, and test IDs.",
  "frontend-file-summaries.txt": "List of summarized descriptions for all frontend source files.",
  "frontend/index.css": "Tailwind-based global styles defining light/dark mode color variables and layout defaults.",
  "frontend/index.html": "HTML entry point bootstrapping the React app and linking the main script and favicon.",
  "frontend/src/App.tsx": "Main React app handling authentication, profile setup flow, and rendering the authenticated layout.",
  "frontend/src/components/auth/LoginScreen.tsx": "Login screen with Internet Identity authentication and feature highlights.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Modal dialog for first‑time users to input and save their profile name.",
  "frontend/src/components/charts/IncomeVsExpenseChart.tsx": "Renders a bar chart comparing monthly income and expenses using fetched totals, with loading and compact display modes.",
  "frontend/src/components/disclosures/ManualEntryDisclosure.tsx": "Shows a notice informing users that all transactions must be entered manually.",
  "frontend/src/components/layout/AppLayout.tsx": "Defines the main app layout with header, navigation, page switching, monthly reminder banner, and logout flow.",
  "frontend/src/components/month/MonthPicker.tsx": "Provides controls to navigate between months and displays the selected month and year.",
  "frontend/src/components/notifications/MonthlyReminderBanner.tsx": "Displays a dismissible banner reminding users to view the previous month's summary when a new month starts.",
  "frontend/src/components/summary/MonthlyTotalsCard.tsx": "Shows monthly totals for received, sent, and balance amounts with icons and loading state handling.",
  "frontend/src/components/transactions/TransactionForm.tsx": "Form for adding income or expense transactions with validation and submission to the backend.",
  "frontend/src/components/transactions/TransactionList.tsx": "Lists monthly transactions with income/expense indicators and handles loading, error, and empty states.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor based on user identity, reinitializing and invalidating queries when identity changes.",
  "frontend/src/hooks/useCurrentUserProfile.ts": "Provides React Query hooks to load and save the logged‑in user's profile via the actor API with cache invalidation.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity context and provider handling identity loading, login, logout, and status tracking.",
  "frontend/src/hooks/useMonthlyReminder.ts": "Manages a per‑principal monthly reminder state using localStorage, with helpers to toggle, acknowledge, and check reminders.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder file documenting where feature-specific query hooks are defined.",
  "frontend/src/hooks/useSelectedMonth.ts": "Stores and persists the selected month and year in localStorage for UI state.",
  "frontend/src/hooks/useTransactions.ts": "Provides React Query hooks to add transactions and fetch monthly transactions and totals via the actor API.",
  "frontend/src/index.css": "Defines Tailwind layers and custom CSS variables for light and dark theme color palettes.",
  "frontend/src/main.tsx": "Bootstraps the app with ReactDOM, wrapping it in QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/SettingsPage.tsx": "Renders settings UI showing profile info, principal ID, and reminder toggle, plus about/disclosure sections.",
  "frontend/src/pages/SummaryPage.tsx": "Displays a monthly financial summary with totals, balance, charts, and auto‑acknowledges the viewed month.",
  "frontend/src/pages/TransactionsPage.tsx": "Shows monthly transaction overview with totals, chart preview, add‑transaction form, and transaction list.",
  "frontend/src/utils/urlParams.ts": "Provides functions to read URL params (including hash), persist them in sessionStorage, and clear them when needed.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending colors, animations, container settings, and registers typography, container-queries, and animate plugins.",
  "project_state.json": "Project metadata describing app purpose, required images, implemented features, and architecture notes for a monthly payment tracker."
}