{
  "kind": "build_request",
  "title": "Monthly Payment Tracker (manual income/expense tracker with monthly summaries, charts, and secure login)",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Implement secure user registration/login using Internet Identity, and gate all app features (transactions, summaries, charts) behind authentication.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-2"
        ],
        "quotes": [
          "Register and log in securely"
        ]
      },
      "acceptanceCriteria": [
        "Unauthenticated users can only see a login/onboarding screen with a clear call to sign in via Internet Identity.",
        "Authenticated users can sign out and are returned to the unauthenticated screen.",
        "All backend methods that read/write user data associate data to the authenticated principal and do not expose other users’ data."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Create a backend transactions data model and persistence for each authenticated user, supporting adding and listing transactions with: type (Received/Income or Sent/Expense), amount, date, and short note.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-2"
        ],
        "quotes": [
          "Add transactions as Received (Income) or Sent (Expense)",
          "Enter transaction amount, date, and a short note",
          "Store all transactions in a database"
        ]
      },
      "acceptanceCriteria": [
        "Backend exposes methods to add a transaction and to list transactions for the caller.",
        "Each transaction includes: unique id, kind (income/expense), amount, date, note, createdAt timestamp.",
        "Data is persisted in stable storage so it survives canister upgrades (use stable structures/state)."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Build a mobile-first transaction entry UI that allows authenticated users to add a transaction as Received (Income) or Sent (Expense) with amount, date, and short note, including basic validation and clear error messages in English.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-2"
        ],
        "quotes": [
          "Add transactions as Received (Income) or Sent (Expense)",
          "Enter transaction amount, date, and a short note",
          "A simple and user-friendly interface"
        ]
      },
      "acceptanceCriteria": [
        "User can choose transaction type (Received/Sent) via an obvious control.",
        "Amount is required and must be a positive number; date is required; note is optional with a reasonable max length.",
        "On successful add, the new transaction appears in the transaction list without a full page refresh (react-query invalidation/refetch)."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Implement monthly filtering for viewing transaction history: users can select a month/year and view only transactions within that month, ordered by date (newest first).",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-2"
        ],
        "quotes": [
          "Monthly filters for viewing transaction history"
        ]
      },
      "acceptanceCriteria": [
        "UI provides a month selector (month + year) optimized for mobile.",
        "The transaction list updates to show only transactions for the selected month.",
        "Selecting a different month updates totals and charts for that month."
      ]
    },
    {
      "id": "REQ-5",
      "text": "Automatically calculate and display monthly totals for the selected month: total received amount, total sent amount, and monthly balance (Received – Sent).",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-2"
        ],
        "quotes": [
          "Calculate total received amount for the selected month",
          "Calculate total sent amount for the selected month",
          "Display the monthly balance (Received – Sent)"
        ]
      },
      "acceptanceCriteria": [
        "For a selected month, the UI clearly shows: Total Received, Total Sent, and Balance.",
        "Totals match the sum of transactions filtered to that month (income adds to received, expense adds to sent).",
        "Balance is computed as received minus sent and updates when transactions are added."
      ]
    },
    {
      "id": "REQ-6",
      "text": "Add a Monthly Summary screen for the selected month that clearly displays income (received), expenses (sent), and balance, with a clean layout suitable for small screens.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-2"
        ],
        "quotes": [
          "Show a monthly summary screen",
          "Display income, expenses, and balance clearly"
        ]
      },
      "acceptanceCriteria": [
        "There is a navigable Summary view for the currently selected month.",
        "Summary view displays the three key numbers with clear labels in English.",
        "Summary view remains readable on a narrow mobile viewport (no horizontal scrolling)."
      ]
    },
    {
      "id": "REQ-7",
      "text": "Implement an optional in-app monthly summary notification mechanism that can alert the user when a month has ended and a summary is ready, without relying on push notifications or external messaging services.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-2"
        ],
        "quotes": [
          "Optionally notify the user about their monthly summary"
        ]
      },
      "acceptanceCriteria": [
        "App includes a user-controlled setting/toggle (e.g., “Monthly summary reminder”) stored per user.",
        "When enabled, the app shows an in-app notice/banner/toast when the current date is in a new month relative to the last time the user viewed/acknowledged a summary (per user).",
        "The notification is fully in-app (no email/SMS/push) and can be dismissed."
      ]
    },
    {
      "id": "REQ-8",
      "text": "Add basic charts to visualize income vs expenses for the selected month (e.g., simple side-by-side bars or a two-segment comparison), rendered in a mobile-friendly way.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-2"
        ],
        "quotes": [
          "Basic charts to visualize income vs expenses"
        ]
      },
      "acceptanceCriteria": [
        "Chart displays two values (income vs expenses) for the selected month in a clear visual comparison.",
        "Chart updates when the selected month changes or when transactions are added.",
        "Chart has accessible labels/legend in English and does not depend on external services."
      ]
    },
    {
      "id": "REQ-9",
      "text": "Apply a cohesive, simple, user-friendly visual theme (colors, typography, spacing, and component styling) consistently across all screens, optimized for a mobile-first experience.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-2"
        ],
        "quotes": [
          "A simple and user-friendly interface"
        ]
      },
      "acceptanceCriteria": [
        "The app uses a consistent design system across screens (buttons, inputs, cards, headings).",
        "Layout is optimized for phone-sized viewports with clear spacing and readable text.",
        "Do not use a blue/purple primary palette unless explicitly requested; choose an alternative coherent palette."
      ]
    },
    {
      "id": "REQ-10",
      "text": "Ensure the app explicitly communicates that transactions are entered manually and that the app does not connect to real bank accounts.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-2"
        ],
        "quotes": [
          "The app does not connect to real bank accounts; transactions are entered manually by the user for safety and simplicity."
        ]
      },
      "acceptanceCriteria": [
        "On first use and/or in a Settings/About section, the app shows a short English statement that transactions are manual and there is no bank connection.",
        "The statement is visible somewhere in the authenticated experience (not only on a hidden page)."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor (all backend logic in backend/main.mo).",
    "Do not modify files under frontend/src/components/ui or other frontend immutable paths; compose/reuse them instead.",
    "No third-party authentication providers; Internet Identity only.",
    "No external databases or cloud services; persist data in the canister’s stable state.",
    "No real-time features (e.g., WebSockets) and no push notification services."
  ],
  "nonGoals": [
    "Connecting to bank accounts or importing transactions automatically.",
    "Implementing SMS/email/push notifications via external providers.",
    "Advanced budgeting features (categories, recurring rules, goal tracking) unless later requested.",
    "Multi-currency support unless later requested."
  ],
  "imageRequirements": {
    "required": [
      "App icon: minimal ledger/checkmark symbol, flat design, warm green palette (app-icon.dim_512x512.png)",
      "Empty state illustration: simple wallet and receipt outline, light background, warm green + neutral gray (empty-transactions.dim_1200x800.png)"
    ],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [
      "Use English for all user-facing text."
    ],
    "preferencesToRemove": [],
    "miscToAdd": [
      "App: Monthly Payment Tracker (manual monthly income/expense tracking with monthly filters, summaries, optional in-app reminders, and basic charts)."
    ],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}