{
  "kind": "build_request",
  "title": "Re-run deployment and stabilize build for Draft Version 2",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-2",
      "text": "Re-run the full build and deployment of the existing Finance Tracker app (Draft Version 2) to production on the Internet Computer, ensuring the process completes successfully end-to-end (frontend build, canister build, and deploy).",
      "target": "unknown",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Run"
        ]
      },
      "acceptanceCriteria": [
        "A full build and deploy completes without errors.",
        "Both frontend and backend canisters are deployed and running.",
        "A live/public app URL is produced as the deployment result."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Identify and resolve any deterministic, project-level causes of intermittent build/deploy failure (e.g., dependency/install issues, typecheck/build errors, missing configuration) so that consecutive deployments can be executed reliably.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-2",
          "msg-6"
        ],
        "quotes": [
          "Correct it and deploy",
          "Run"
        ]
      },
      "acceptanceCriteria": [
        "Two consecutive build+deploy runs complete successfully without requiring manual intervention.",
        "If any code/config changes are needed, they are committed to the repository and do not break existing app functionality (login, profile save, add transaction, monthly totals)."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in backend/main.mo; only introduce backend/migration.mo if an upgrade requires state migration.",
    "Do not modify files under frontend/src/components/ui or any frontend immutablePaths listed in SYSTEM_CONTEXT; compose them instead.",
    "Use English for any user-facing text."
  ],
  "nonGoals": [
    "Adding new product features beyond what is required to achieve a successful, repeatable deploy.",
    "Changing authentication away from Internet Identity.",
    "Introducing external databases, third-party hosting, or non-supported backend languages."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}