{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Stabilize Finance Tracker Draft v2 frontend build/deploy reliability",
  "requirements": [
    {
      "id": "REQ-2",
      "summary": "Ensure the frontend build portion of the existing app is production-deployable and produces a stable public URL for sharing.",
      "acceptanceCriteria": [
        "A full build and deploy completes without errors.",
        "Both frontend and backend canisters are deployed and running.",
        "A live/public app URL is produced as the deployment result."
      ],
      "file_operations": [
        {
          "path": "frontend/src/utils/getPublicAppUrl.ts",
          "operation": "modify",
          "description": "Harden public URL resolution for Internet Computer production builds by documenting/standardizing the expected environment variable(s) and ensuring safe fallbacks so the deployed app always has a shareable public URL. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/README.md",
          "operation": "modify",
          "description": "Update frontend deployment/run documentation to include the required build-time environment variables (e.g., public app URL and Internet Identity provider URL), and a repeatable build verification checklist that aligns with the IC deploy flow. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Remove deterministic, project-level causes of intermittent frontend build/typecheck failures to enable consecutive reliable deployments without manual intervention.",
      "acceptanceCriteria": [
        "Two consecutive build+deploy runs complete successfully without requiring manual intervention.",
        "If any code/config changes are needed, they are committed to the repository and do not break existing app functionality (login, profile save, add transaction, monthly totals)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useInternetIdentity.ts",
          "operation": "modify",
          "description": "Eliminate non-Vite-safe environment access (e.g., process.env) and standardize configuration lookup via Vite-compatible environment variables with robust defaults to prevent production build failures. Ensure Internet Identity login continues to work. Use the authorization component patterns for Internet Identity authentication behavior; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/hooks/useActor.ts",
          "operation": "modify",
          "description": "Make actor initialization more resilient during consecutive deploy/test cycles by guarding initialization steps and improving error handling around access-control initialization so transient config/token absence does not break app boot. Use the authorization component guidance for login-required data access and cache clearing; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/vite-env.d.ts",
          "operation": "create",
          "description": "Add Vite environment variable typings for any required build-time variables (e.g., public app URL and Internet Identity provider URL) to prevent intermittent typecheck failures across environments. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/.env.example",
          "operation": "create",
          "description": "Provide a canonical example of required Vite-prefixed environment variables used by the frontend build to reduce install/config drift that can cause intermittent build/deploy failures. Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}